In [2]:
# Dependencies
import pandas as pd

In [3]:
# Military Expenditure Data from Kaggle as: https://www.kaggle.com/nitinsss/military-expenditure-of-countries-19602019
# Store the military expediture filepath in a variable
mil_spend = "data/Military Expenditure.csv"

In [4]:
# Read our the Economic Freedom of the World Dataset with the pandas library
mil_spend_df = pd.read_csv(mil_spend)

In [5]:
# Show just the header
# mil_spend_df.head()
# Show just the columns
mil_spend_df.columns

Index(['Name', 'Code', 'Type', 'Indicator Name', '1960', '1961', '1962',
       '1963', '1964', '1965', '1966', '1967', '1968', '1969', '1970', '1971',
       '1972', '1973', '1974', '1975', '1976', '1977', '1978', '1979', '1980',
       '1981', '1982', '1983', '1984', '1985', '1986', '1987', '1988', '1989',
       '1990', '1991', '1992', '1993', '1994', '1995', '1996', '1997', '1998',
       '1999', '2000', '2001', '2002', '2003', '2004', '2005', '2006', '2007',
       '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016',
       '2017', '2018'],
      dtype='object')

In [6]:
mil_spend_reduced_df = pd.DataFrame(mil_spend_df[["Name", "2012"]])

In [7]:
# mil_spend_reduced_df.head()

          Name          2012
0        Aruba           NaN
1  Afghanistan  2.385834e+08
2       Angola  4.144635e+09
3      Albania  1.832047e+08
4      Andorra           NaN

In [8]:
# rename columns
mil_spend_reduced_df.columns = ["Country Name", "Mil Expenditure"]
mil_spend_reduced_df.head()

  Country Name  Mil Expenditure
0        Aruba              NaN
1  Afghanistan     2.385834e+08
2       Angola     4.144635e+09
3      Albania     1.832047e+08
4      Andorra              NaN